---
kind: property
id: P:Autodesk.Revit.UI.ExternalApplicationArray.IsEmpty
source: html/dc8e9315-83b0-37ff-2679-820ca029b710.htm
---
# Autodesk.Revit.UI.ExternalApplicationArray.IsEmpty Property

Test to see if the array is empty.

## Syntax (C#)
```csharp
public virtual bool IsEmpty { get; }
```

## Remarks
If the array is empty then True will be returned, otherwise False.